{
  "positions": [
    {
      "id": "soomo-learning",
      "title": "Software Engineer",
      "company": "Soomo Learning",
      "companyDescription": "E-Learning platform for college students",
      "industries": ["Education"],
      "period": { "start": "2022-02", "end": "2025-03" },
      "employmentType": "full-time",
      "stack": [
        "Ruby on Rails",
        "React",
        "TypeScript",
        "SQL",
        "FullStory",
        "Heroku",
        "Cucumber",
        "RSpec",
        "Tailwind CSS",
        "Playwright"
      ],
      "highlights": [
        "Developed and managed React microsites that interact with a Rails monolith. Things like analytics, reporting, and due date management were all built as separate projects.",
        "Built admin tools for efficient customer data management. Since all of our content was produced in-house, we had several admin tools to manage the content.",
        "Improved student engagement and accessibility while preserving annotations and analytics. Education was our passion and we wanted to make sure we were doing everything we could to help students succeed."
      ]
    },
    {
      "id": "mib",
      "title": "Software Engineer",
      "company": "MIB",
      "companyDescription": "Custom life insurance sales solutions",
      "industries": ["Healthcare", "Marketing", "Sales"],
      "period": { "start": "2017-08", "end": "2022-02" },
      "employmentType": "full-time",
      "stack": [
        "Java",
        "Maven",
        "Apache Tomcat",
        "React",
        "CSS",
        "HTML",
        "JavaScript",
        "SQL",
        "Tailwind CSS"
      ],
      "highlights": [
        "Worked with clients to design and develop custom web applications. We would work with them to understand their needs and then develop a solution to meet those needs.",
        "Build custom web applications using React, Tailwind CSS, and Java. The backend was ran on an Apache Tomcat server using Maven to build the application and SQL to store the data.",
        "Introduced an optimized production build process integrating React and Maven with Vite for hot reloading. Vite was more performant and hot reloading was a must-have for a developer experience."
      ]
    },
    {
      "id": "sci-fusion360",
      "title": "Software Developer",
      "company": "SCI Fusion360",
      "companyDescription": "Software contracting",
      "industries": ["Fintech", "Enterprise", "Banking", "Internal tools"],
      "period": { "start": "2016-05", "end": "2017-08" },
      "employmentType": "full-time",
      "stack": ["Java", "Windows", "Maven", "SQL"],
      "highlights": [
        "Created a new payment processing application for banks by enhancing an existing Java monolith. This was a large application with many sections and it was a challenge to understand the codebase and make changes.",
        "Developed RESTful API endpoints for user creation and payment processing. This was a new application and I was able to design the API from the ground up.",
        "Was the only developer who was able to see the application from 0-1. Not only was I able to help build the application, but I was also able to help the client understand the application and how it worked when it was time for deployment."
      ]
    }
  ]
}
